In [1]:
import numpy as np
import pandas as pd

In [6]:
a = pd.DataFrame([{'aa':1, 'bb':2},{'bb':5,'cc':8}])
a.to_dict()

{'aa': {0: 1.0, 1: nan}, 'bb': {0: 2, 1: 5}, 'cc': {0: nan, 1: 8.0}}

From a two dimensional numpy array

In [15]:
 pd.DataFrame(np.random.randint(1,20),
    columns=['One','two'],
    index=['a','b','c'])

   One  two
a    5    5
b    5    5
c    5    5

# Pandas Index Object

In [17]:
ls= pd.Index([12,32,45,98,15,64,5])
ls

Int64Index([12, 32, 45, 98, 15, 64, 5], dtype='int64')

In [21]:
print(ls[4])
print(type(ls))

15
<class 'pandas.core.indexes.numeric.Int64Index'>

# Index as immutable array

In [23]:
ls[:]

Int64Index([12, 32, 45, 98, 15, 64, 5], dtype='int64')

In [25]:
ls[1:7:2]

Int64Index([32, 98, 64], dtype='int64')

In [26]:
print(ls.ndim,ls.shape,ls.dtype,ls.size)

1 (7,) int64 7

# Operating on Data in Pandas

# Ufunc :Index Perservation

In [39]:
we = np.random.RandomState(25) # randomstate is a  point in a memory location which exact matches 30% and 40% is spliited
s = pd.Series(we.randint(0,20,4))
s

0     4
1    15
2    12
3    18
dtype: int64

In [38]:
print(we)

RandomState(MT19937)

In [50]:
gh = pd.DataFrame(we.randint(0,20,(5,4)),
                 columns = ['A','B','C','D'])
gh

    A   B   C   D
0   6  19   4  10
1   0  13   2   5
2   7  16  18  13
3   0  12   5   6
4  11  10   2  18

In [52]:
np.log(s)

0    1.386294
1    2.708050
2    2.484907
3    2.890372
dtype: float64

In [54]:
np.sin(gh * np.pi/4)

          A             B             C         D
0 -1.000000  7.071068e-01  1.224647e-16  1.000000
1  0.000000 -7.071068e-01  1.000000e+00 -0.707107
2 -0.707107 -4.898587e-16  1.000000e+00 -0.707107
3  0.000000  3.673940e-16 -7.071068e-01 -1.000000
4  0.707107  1.000000e+00  1.000000e+00  1.000000

# Universal Functions :Index alignment

# Index alignment in series

In [61]:
area = pd.Series({'Alaska':54656, 'Texas':89489 , 'California':5464},name = 'area') #name = name of the table
population = pd.Series({'California':44121,'Texas': 7564164894,'New York':8974615},name = 'popularion')
print(population)
area

California         44121
Texas         7564164894
New York         8974615
Name: popularion, dtype: int64

Alaska        54656
Texas         89489
California     5464
Name: area, dtype: int64

In [63]:
h=pd.DataFrame(area)
h

             area
Alaska      54656
Texas       89489
California   5464

In [64]:
population/area  #matching index

Alaska                 NaN
California        8.074854
New York               NaN
Texas         84526.197566
dtype: float64

In [66]:
area.index|population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [74]:
A = pd.Series([2,4,6],index = [0,1,2])
B =pd.Series([4,8,7],index = [1,2,3])
print(A)
print(B)

0    2
1    4
2    6
dtype: int64
1    4
2    8
3    7
dtype: int64

In [72]:
A+B

0     NaN
1     8.0
2    14.0
3     NaN
4     NaN
dtype: float64

In [75]:
A+B

0     NaN
1     8.0
2    14.0
3     NaN
dtype: float64

In [77]:
A.add(B,fill_value=0)   #fills the values

0     2.0
1     8.0
2    14.0
3     7.0
dtype: float64

# Ufunc:Operation Between DataFrame and Series

# Merge Operations

In [98]:
a2 = pd.DataFrame({'Country':["JK","DF","FG"],'Population':["121654","651685","546165"]})

In [99]:
a2

  Country Population
0      JK     121654
1      DF     651685
2      FG     546165

In [87]:
a

    aa  bb   cc
0  1.0   2  NaN
1  NaN   5  8.0

In [91]:
data = {"Country":["DF","FG","IH","JK","UI"],
       "Year":[2010,2011,2005,2009,2008],
       "Points":[1.2,0.5,6.8,8.4,2.6]}

In [96]:

data = pd.DataFrame(data)
data

  Country  Year  Points
0      DF  2010     1.2
1      FG  2011     0.5
2      IH  2005     6.8
3      JK  2009     8.4
4      UI  2008     2.6

In [102]:
a = data.merge(a2)

In [103]:
data

  Country  Year  Points Population
0      DF  2010     1.2     651685
1      FG  2011     0.5     546165
2      JK  2009     8.4     121654

# Combining data with overlap

In [115]:
s1 = pd.Series([np.nan,8.9,np.nan,6.3,9.6,np.nan],
              index = ['a','s','f','l','g','o'])

In [116]:
s2 = pd.Series(np.arange(len(s1),dtype=np.float64),index =['a','s','f','l','g','o'])

In [111]:
s1

a    NaN
s    8.9
f    NaN
l    6.3
g    9.6
o    NaN
dtype: float64

In [112]:
s2

a    0.0
s    1.0
f    2.0
l    3.0
g    4.0
o    5.0
dtype: float64

In [114]:
pd.Series(np.where(pd.isnull(s1),s2,s1),index = s1.index)

a    0.0
s    8.9
f    2.0
l    6.3
g    9.6
o    5.0
dtype: float64

In [117]:
s1.combine_first(s2)

a    0.0
s    8.9
f    2.0
l    6.3
g    9.6
o    5.0
dtype: float64